{
  "date-generated": "August 29, 2013, 3 a.m.",
  "players": [
    {
      "bio": "In 2012, Hundley set school records for single-season completions and passing yards in just his first year under center. He threw for 29 touchdowns and ran for nine more, including a 72-yarder in his first collegiate play from scrimmage v. Rice. ",
      "name": "Brett Hundley"
    },
    {
      "bio": "Still the team’s backup quarterback, and a year removed from being the scout team quarterback, Neuheisel takes on the kneeling position to replace yet another of Jeff Locke’s important duties. A well-performing holder is one that goes unnoticed during special teams plays, and so far, Neuheisel has received snaps from Christopher Longo the best of his abilities.",
      "name": "Jerry Neuheisel"
    },
    {
      "bio": "Fafaul, a redshirt freshman quarterback from Cockeysville, Md., came to UCLA as a preferred walk-on but caught the public eye for his quick release and impressive accuracy. After graduating from high school with only a single offer from the University of New Hampshire, he chose to spend a year at Fork Union Military Academy building strength and skills. While at Fork Union, he quickly gained attention from a number of D1 schools on his path to an 8-1 record. After T.J. Millweard’s transfer, Fafaul and Neuheisel will compete for the backup quarterback spot.",
      "name": "Mike Fafaul"
    },
    {
      "bio": "UCLA was late to the party when recruiting Woulard but impressed him so much that he signed with the Bruins over teams closer to his home and ones he had known for longer. Woulard was rated a four-star recruit by Rivals.com and Scout.com and was named the MVP of the Elite 11 quarterback camp run by former NFL QB Trent Dilfer. Despite only 21 starts at quarterback under his belt, Woulard was impressive at fall camp. With Brett Hundley entrenched at the starting quarterback position, Woulard is likely to redshirt this year to preserve his four years of eligibility.",
      "name": "Asiantii Woulard"
    },
    {
      "bio": "A redshirt freshman from Newport Beach, Calif., Hall redshirted last season. He will compete for a backup role this season.",
      "name": "Jake Hall"
    },
    {
      "bio": "Cross, a graduate student, spent his undergraduate years at Wake Forest, making nine career appearances. He has one year of NCAA eligibility remaining, and even switched to wide receiver at times in San Bernardino.",
      "name": "Brendan Cross"
    },
    {
      "bio": "In what could prove to be a “by committee” running back system for the Bruins this season, James has a strong chance of earning the most snaps, impressing coaches in the offseason with his pass protection abilities. Last year, James rushed for 214 yards and two touchdowns on 62 carries.",
      "name": "Jordon James"
    },
    {
      "bio": "Manfro saw significant playing time as a redshirt freshman last season. He returned punts and kicks, as well as getting snaps as a slot receiver. Manfro hauled in 28 receptions, good for fifth on the team. He struggled at times with fumbles as a returner, however.",
      "name": "Steven Manfro"
    },
    {
      "bio": "By ending up at UCLA, Perkins once again ended up at the same school as a former classmate, quarterback Brett Hundley. Perkins was a three-star recruit (Rivals.com/Scout.com) who gained first-team all-state recognition at home in Arizona his senior year. After redshirting last year, Perkins figures to play a large role in UCLA’s running back by committee approach this season.",
      "name": "Paul Perkins"
    },
    {
      "bio": "Redshirt sophomore running back Emesibe has been steadily gaining attention since walking on during winter practice in 2010. In 2012, he ran for 40 yards and a touchdown. After a promising high school career, which included being named to the first-team Mojave River League, his senior season ended abruptly with a broken leg in his first game. But since sitting out his redshirt season, he’s had a good number of carries in spring practice and spent much of camp returning punts. Emesibe joins a family legacy of collegiate football, as twin brother Galvin played defensive tackle at UC Davis and cousin Femi played cornerback at San Diego State.",
      "name": "Melvin Emesibe"
    },
    {
      "bio": "A four-star recruit out of Redlands, Calif., Lee’s future with the Bruins was in question throughout the latter half of his senior year of high school. After signing with UCLA, Lee had to improve his test scores in order to be academically eligible. He was cleared to play in July. Although he has potential, Lee isn’t likely to see much of the field this season, as he was not included in the list of running backs Mora said he “trusted” during fall camp.",
      "name": "Craig Lee"
    },
    {
      "bio": "After not seeing any game action in 2011, Davis played in 12 games last season on special teams. In 2011, his efforts as a Bruin were rewarded when he received the Charles Pike Memorial Award for Outstanding Scout Team Player (special teams).",
      "name": "Roosevelt Davis"
    },
    {
      "bio": "For Thigpen, staying healthy has been an issue throughout his UCLA career. He had an impressive season as a true freshman in 2009, with big plays running and catching the ball as well as solid special teams play. Since then, a shoulder injury cut his 2010 season short and a nagging groin injury kept him from seeing the field in 2011, leading to a redshirt year. His impressive year as a backup running back last season was cut short with a torn ACL against USC. Thigpen should return from that injury partway through this season and should contribute upon his return.",
      "name": "Damien Thigpen"
    },
    {
      "bio": "Jones entered UCLA as one of the most hyped prospects in the history of the program as he was named the Gatorade National High School Player of the Year. However his college career hasn’t lived up to his high school one. After two years as a backup, Jones left the team after one game last year, looking for a transfer. He changed his mind after the season, however, and was re-enrolled at UCLA in April. Despite only playing in last season’s first game and getting only three carries, the NCAA denied his appeal for an extra year of eligibility, making this year Jones’ last.",
      "name": "Malcolm Jones"
    },
    {
      "bio": "After redshirting last season, Davis, from Lancaster, Calif., will look to compete for playing time this season.",
      "name": "Ryan Davis"
    },
    {
      "bio": "Replacing All-Pac-12 special teams player David Allen is Ruhl, whose only action came in six games last season as a special teams player. Aside from a few goal-line and run-heavy sets, the fullback, whose primary job is to pick up blockers, isn’t used too often in Noel Mazzone’s offense, which mainly opts for the F, or another slot receiver.",
      "name": "Phillip Ruhl"
    },
    {
      "bio": "Iese is the cousin of teammate Seali'i Epenesa. Initially a linebacker, Iese has seen time in practice as a Y receiver and at fullback recently and could get some snaps at those positions on offense.",
      "name": "Nate Iese"
    },
    {
      "bio": "Hailing from Edison High School in Huntington Beach, Gane transitioned to fullback in Noel Mazzone’s offense. Gane played sparingly last season, seeing time only on special teams.",
      "name": "Luke Gane"
    },
    {
      "bio": "Originally playing on the defensive side of the ball, Hale made the switch to offensive guard during 2012 spring camp. Hale prepped locally at Damien High School in La Verne, Calif., where he played on both the offensive and defensive lines. He also participated in the San Gabriel Valley Hall of Fame All-Star game. Hale saw some playing time on special teams last season and became a scholarship player in the 2012 preseason.",
      "name": "Tre’ Hale"
    },
    {
      "bio": "Yards-wise, Evans returns for his third season with UCLA as the Bruins’ leading 2012 receiver, hauling 60 passes, also a team-high, for 877 yards. As he looks to break the 1,000-yard barrier for the first time in his career, his biggest area of improvement will likely be touchdowns, of which he had just three last season.",
      "name": "Shaquelle Evan"
    },
    {
      "bio": "Out of Santa Margarita Catholic High School, Sweet provides nice depth for the Bruins at receiver. After redshirting his first year, Sweet had two receptions for 47 yards and a touchdown last season. He became a scholarship player this preseason. He will have to fight off a few other receivers this season for playing time on offense. As a senior in high school, Sweet had 34 receptions for 733 yards and 11 touchdowns and also participated in track and field in high school.",
      "name": "Logan Sweet"
    },
    {
      "bio": "Andrews, who also ran track in high school, was rated a three-star recruit by Scout.com and Rivals.com. With the Bruins’ depth at receiver, it’s uncertain how much time he’ll see this season as a slot receiver.",
      "name": "Darren Andrews"
    },
    {
      "bio": "Tyler Scott saw his first game action last year, but did not have any catches, playing mostly on special teams. Scott is also a member of the national champion UCLA baseball team, where he is a backup outfielder. Scott was selected in the 41st round of the 2011 MLB Draft by the Texas Rangers. As a junior at Marin Catholic High School, Scott accounted for 13 touchdowns on offense.",
      "name": "Tyler Scott"
    },
    {
      "bio": "Building off a productive freshman season in which he caught 18 passes for 202 yards, Payton’s production is set to increase as he will start opposite Evans, taking on Jerry Johnson’s starting position from a year ago. Payton has remained consistent throughout the offseason in his blocking and catching, giving him the starting job over Devin Lucien, who also figures to be a force in four-receiver sets.",
      "name": "Jordan Payton"
    },
    {
      "bio": "After redshirting his first year, Lucien broke onto the scene last season. He was one of UCLA’s most dynamic receivers, with ten catches for 188 yards in six games until an injury kept him out until the Holiday Bowl. Lucien figures to be one of the first receivers off the bench this season.",
      "name": "Devin Lucien"
    },
    {
      "bio": "Massington, a four-star recruit according to both Rivals.com and Scout.com, enrolled early at UCLA, starting in January of last year. He got extra experience with the team while he continued to rehab from a knee injury that kept him from playing his senior year.",
      "name": "Eldridge Massington"
    },
    {
      "bio": "Walker was one of the best surprises for UCLA during last year’s fall camp in San Bernardino. Walker is an electric athlete with great hands.He played in 12 games last season, with 11 catches for 87. He also handled some kick return duties. In high school Walker played wide receiver, running back, quarterback, punter and kick returner. Walker was a high school state finalist in hurdles his sophomore through senior years. He was considered a three-star recruit by every major recruiting service coming out of high school.",
      "name": "Kenneth Walker"
    },
    {
      "bio": "A redshirt freshman from Malibu, Calif., Hernandez was a second-team All-Serra League receiver for Oaks Christian High School. He has yet to see any game action for UCLA.",
      "name": "Zach Hernandez"
    },
    {
      "bio": "A three-time letterman in football at Barrington High School in Illinois, Handler has a brother who also plays college football at Pac-12 South counterpart Colorado. It is highly unlikely Handler will see much time this season with the amount of receiving depth the Bruins have. He served as a team captain as a senior in high school and had 45 catches for 500 yards receiving his senior year. Handler also lettered once in basketball and baseball.",
      "name": "Sam Handler"
    },
    {
      "bio": "Pasquale is a redshirt freshman wide receiver from San Clemente High School.",
      "name": "Nick Pasquale"
    },
    {
      "bio": "Since transferring to UCLA in 2010, Bell had not seen much action in the blue and gold until last season,when he transferred from quarterback to the Y spot. In 2012, played in ten games, recording seven catches for 143 yards. Bell had an extremely successful high school campaign at Archbishop Riordan in San Francisco. He led his team to a Central Coast Section title in 2007, the same year that he was named Quarterback of the Year in his league. After high school, Bell proceeded across the street to City College of San Francisco, where he led the team to a 9-1 record in 2009. He should see a significant amount of playing time this season.",
      "name": "Darius Bell"
    },
    {
      "bio": "After sitting out last season due to his transfer from East Carolina University, Mazzone returns for his final season with the Bruins looking to make a name for himself as a slot receiver. The Y, however, will likely not be owned by any one player, as fellow RS senior Darius Bell, RS sophomore Natie Iese and freshman Thomas Duarte, who Mora said could get as many as 40 snaps per game, will all likely see field time.",
      "name": "Grayson Mazzone"
    },
    {
      "bio": "Duarte, a freshman from Mater Dei High School in Fullerton, Calif., was rated a four-star recruit by Rivals and Scout. The Orange County Register named him its Area Offensive Player of the Year after his 58 receptions, 1,025 yards and 17 touchdowns as a senior. Mora spoke highly of Duarte during fall camp and said he could potentially see up to 40 snaps per game.",
      "name": "Thomas Duarte"
    },
    {
      "bio": "Eaton is a redshirt freshman wide receiver from Los Altos High School.",
      "name": "Daniel Eaton"
    },
    {
      "bio": "Barrett began his career at UNLV after graduating from Notre Dame High School and playing as a linebacker there. Barrett climbed up the depth chart as an H-back and tight end in the UNLV offensive system, impacting Rebels immediately. Barrett transferred to UCLA and is now entering his redshirt senior season, where he will be a Y-receiver for the Bruins.",
      "name": "Jordan Barrett"
    },
    {
      "bio": "Expect Fuller, now a year solidified into his slot receiver position after playing quarterback for much of his life, to have a breakout season in 2013. Despite only amassing 145 yards receiving and two touchdowns last season, Fuller’s quickness and precise route-running should serve him well as he goes over the middle more this season.",
      "name": "Devin Fuller"
    },
    {
      "bio": "Ortiz, a three-star recruit, was recruited as a running back in high school, however he has made the switch to wide receiver at UCLA. As a high school senior, Ortiz excelled in multiple areas. He ran for 1,401 yards and 12 touchdowns, caught 32 passes for 501 yards and scored five receiving touchdowns and played defense, totaling 19 tackles and four interceptions. Ortiz was also the kick returner, averaging over 25 yards per return. His versatility and athleticism could make him a valuable asset for the Bruins throughout his college career, though talented slot receivers in front of him will make consistent playing time difficult this season.",
      "name": "Jalen Ortiz"
    },
    {
      "bio": "When recruiting Harris to come to UCLA, Jim Mora didn't stray far from a place he used to call home: Atlanta. Harris, a second-team all-state wide receiver from nearby Suwanee, Ga., was one of two of last year’s recruits that Mora plucked from the Peach State, along with Kenny Orjioke.",
      "name": "Ahmaad Harris"
    },
    {
      "bio": "A year after starting 13 games at right tackle, Goines has flipped over to the other side of the line to protect Brett Hundley’s blind side. He has lost five pounds heading into this season, a change that more reflects a reshaping of his body. Much improved this fall camp, Goines’ biggest challenge will be staying healthy, an issue that forced him to be taken out of several games last year.",
      "name": "Simon Goines"
    },
    {
      "bio": "2013 marks McDermott’s second season with the Bruins. The redshirt freshman offensive lineman hails from Nashville, Tenn., where he played for Ensworth High School. McDermott is the younger brother of UCLA’s former starting long snapper, Kevin McDermott.",
      "name": "Conor McDermott"
    },
    {
      "bio": "Using his impressive reach and muscular frame to direct blitzing linebackers away from Hundley this year will be White, who added a fair amount of weight in muscle with strength and conditioning coach Sal Alosi during the offseason. In his second year as a starter, White’s punch at the point of attack will open up holes for James, but his concern, as with Goines, will be staying healthy and on the field.",
      "name": "Torian White"
    },
    {
      "bio": "Wysocki was redshirted his first year in Westwood and saw some playing time as a backup and on special team in 2012. Wysocki will play a similar role for the team this year, stepping in if injuries occur.",
      "name": "Ben Wysocki"
    },
    {
      "bio": "Cyburt entered his freshman year at UCLA as one of the top 50 offensive tackles in his recruiting class. He played high school ball at Mission Viejo and garnered accolades such as Division I All-State and an ESPN All-Western United Stated first teamer. He played in the CIF title game as a junior in high school. He took a redshirt year last season.",
      "name": "Colby Cyburt "
    },
    {
      "bio": "Morris, a four-star recruit according to both Rivals.com and Scout.com, earned a spot in the U.S. Army All-American Bowl Game after an impressive senior year at East High School in Memphis, Tenn. As a senior Morris recorded over 50 pancake blocks. ",
      "name": "Christian Morris"
    },
    {
      "bio": "Moala was rated a four-star recruit by both Rivals.com and Scout.com, making him another freshman offensive lineman with impressive credentials. Scout ranked him the No. 11 offensive tackle in the nation coming out of high school. Should injuries hit along the offensive line, Moala could see some action this year.",
      "name": "Poasi Moala"
    },
    {
      "bio": "In July, coach Jim Mora mentioned that an indication of his line’s strength would be whether Su’a-Filo, the line’s most versatile athlete, had to play tackle or could stay inside at his preferred left guard position. With Goines and White now solidified at the tackle positions, it appears the 27-game starter and 2012 All-Pac-12 first team selection from a year ago will be able to stay inside for the Bruins in 2013.",
      "name": "Xavier Su’a-Filo"
    },
    {
      "bio": "While listed as a tackle, Lacy could see some snaps as backup left guard said coach Jim Mora during fall practice. Lacy impressed during fall camp after coming to UCLA rated as a four-star recruit by Scout.com and Rivals.com.",
      "name": "Kenny Lacy"
    },
    {
      "bio": "Described by offensive line coach Adrian Klemm as strong with very active hands and a high football IQ, Benenoch had the best fall camp of any of 2013’s seven offensive line recruits, earning the starting job at right guard. As was the case with Goines and White, 2013 will provide Benenoch with a number of learning opportunities as he progresses from high school to facing some of the Pac-12’s elite defensive ends.",
      "name": "Caleb Benenoch"
    },
    {
      "bio": "Redmond is part of a much-anticipated offensive line recruiting class for the Bruins. A Scout.com and Rivals.com four-star recruit out of Los Alamitos High School in Cerritos, Calif., Redmond may not play much early on, but could be a factor in the future of UCLA’s offensive line.",
      "name": "Alex Redmond"
    },
    {
      "bio": "McReynolds traveled across the country, from Washington, D.C., to play for the Bruins after four years at St. John’s College High School. In his first season as a Bruin in 2011, McReynolds did not see game action, but received the Charles Pike Memorial team award for Outstanding Defensive Scout Team Player. McReynolds played in 13 games last season, moving from defensive to offensive line. If the Bruins suffer injuries along the line, McReynolds could see some action this year.",
      "name": "Kevin McReynolds"
    },
    {
      "bio": "Another member of UCLA’s strong offensive line recruiting class, Lopez was a four-star recruit according to Rivals.com. Lopez will likely see very little playing time as a freshman.",
      "name": "John Lopez"
    },
    {
      "bio": "Earning the team’s Most Improved Offensive Player award last season, Brendel has cemented himself as a leader in UCLA’s offense, being voted a captain as just a redshirt sophomore and once again starting at the center position. Expect Brendel, an All-Pac-12 Honorable Mention and Freshman All-America from a year ago, to anchor an offensive line that has had a year to grow.",
      "name": "Jake Brendel"
    },
    {
      "bio": "A freshman from La Costa, Calif., Quessenberry comes to UCLA as part of a highly touted group of freshman offensive linemen. Quessenberry was a three-star recruit according to both Scout.com and Rivals.com and was ranked as among the top seven centers of his recruiting class in the nation according to both websites. A member of the Under Armour All-American team, Quessenberry will have to wait his turn behind incumbent starter redshirt sophomore Jake Brendel.",
      "name": "Scott Quessenberry"
    },
    {
      "bio": "Entering his second season with the Bruins, Hulick didn’t see the field his first year, playing on the scout team instead. A three-star recruit according to Scout.com, Hulick also spent four years on his high school’s wrestling team where he qualified for the state meet twice, finishing fourth and ninth.",
      "name": "Carl Hulick"
    },
    {
      "bio": "Lost a bit in the middle of defensive end Datone Jones’ Draft hype last season was the production of Marsh, who started all 14 games at defensive end and recorded 50 tackles, 10.5 for loss. In his final season with the Bruins, expect Marsh to have yet another productive fall with the Bruins after impressing once again in San Bernardino. Maybe this time around, the NFL Draft hype will be his own.",
      "name": "Cassius Marsh"
    },
    {
      "bio": "Initially committed to USC, Fitts switched his commitment to UCLA after the Trojans were unable to allow him to enroll early after he graduated high school early. Fitts arrived at UCLA for spring quarter, practicing with the team during spring practice. Rated a four-star recruit by both Rivals.com and Scout.com, Fitts could see some playing time as a reserve this season as he continues to improve.",
      "name": "Kylie Fitts"
    },
    {
      "bio": "Rated a three-star recruit by Rivals.com, Ankou redshirted last season. Coach Jim Mora praised Ankou’s strength, claiming during spring practice that Ankou can do five pull-ups with a 100-pound weight strapped to his chest.",
      "name": "Eli Ankou"
    },
    {
      "bio": "Graham, although slightly undersized for a defensive end, makes up for his weight deficiency with an impressive show of speed, one that allows him to get to the quarterback quickly. Though Graham’s skill throughout spring football and fall camp earned him the nod from coaches, expect freshman Eddie Vanderdoes to contend for the job once he gets his wind in the next few weeks.",
      "name": "Keenan Graham"
    },
    {
      "bio": "After missing 2011 because he transferred from North Carolina, Willis played in six games as a reserve last season. He finished the year with five tackles and one recovered fumble.",
      "name": "Brandon Willis"
    },
    {
      "bio": "Vanderdoes got his fair share of media attention both during and after his recruitment. On the day of his official announcement, Vanderdoes’ decision to attend Notre Dame was leaked early. Then, after Vanderdoes’ grandmother’s declining health prompted him to ask for a release from his letter of intent so he could be close to her, Notre Dame coach Brian Kelly refused to do so. Vanderdoes had to appeal to the National Letter of Intent Steering Committee in order to prevent losing a year of eligibility. The committee cleared Vanderdoes on July 30 and the freshman is expected to contribute early and compete for a starting spot by the end of the season.",
      "name": "Eddie Vanderdoes"
    },
    {
      "bio": "After seeing some action as a Y last season, Taubler looks to make the switch to defensive end this year. Taubler played both tight end and defensive end at Bullard High School in Fresno, Calif.",
      "name": "Ian Taubler"
    },
    {
      "bio": "Tai not only starred as a defensive end in high school, but also played at quarterback and tight end at Liberty High School in Henderson, Nev. Tai graduated early from high school to attend UCLA early two years ago. He has yet to play after a torn Achilles tendon during fall camp last year ended his season.",
      "name": "Sam Tai"
    },
    {
      "bio": "Odighizuwa will take a redshirt year this season as he recovers from a lingering hip injury. He came to UCLA as a highly touted prospect, ranked No. 8 in the country by Rivals.com, but has yet to make as big an impact as his recruitment would suggest. In 2012, he finished with 44 tackles, the ninth most for the Bruins. His athleticism and size suggest that he may be able to break out if he learns to vary his moves on the defensive line.",
      "name": "Owamagbe Odighizuwa"
    },
    {
      "bio": "A starter in 10 games last season, expect Epenesa to be challenged by sophomore Ellis McCarthy for his starting job throughout the season. Strong and physical, the job of Epenesa, who recorded 21 stops in 2012, will be absorbing two blockers on most plays, leaving the Bruins’  two other defensive linemen and four linebackers with more winnable one-on-one matchups.",
      "name": "Seali’i Epenesa"
    },
    {
      "bio": "McCarthy was arguably the Bruins’ most highly touted signing of the 2012 recruiting class, but there’s no doubt that he was the biggest. The 6-foot-4, 330-pound defensive lineman made 10 tackles and one sack in his nine games played as a reserve last season. McCarthy has yet to completely live up to his five-star recruit statusdrom game, given to him by Scout.",
      "name": "Ellis McCarthy"
    },
    {
      "bio": "A native of San Bernardino, Calif., Clark was rated a four-star recruit by both Scout.com and Rivals.com. As a high school senior, Clark had 71 tackles, 11 sacks and five forced fumbles. He could see time as a reserve defensive lineman this season.",
      "name": "Kenny Clark"
    },
    {
      "bio": "The redshirt sophomore had five appearances last season, finishing with three tackles. He will compete for playing time at a crowded nose tackle position.",
      "name": "Brandon Tuliaupupu"
    },
    {
      "bio": "Earning the start at Damien Holmes’ position from a year ago is Wallace, whose consistency impressed coaches throughout fall camp. While he could be challenged by sophomore Kenny Orjioke and freshman Myles Jack as the season progresses, Wallace is now tasked with the challenge of playing opposite Anthony Barr, which will undoubtedly earn him more attention from offenses.",
      "name": "Aaron Wallace"
    },
    {
      "bio": "Jack, who also played running back at Bellevue High School in Bellevue, Wash., was rated a four-star recruit by both Rivals.com and Scout.com. He recorded five tackles in the U.S. Army All-American Bowl Game. Jack looked impressive during fall camp, prompting Mora to say he anticipated Jack seeing a fair amount of playing time this season, possibly being used to help cover receivers.",
      "name": "Myles Jack"
    },
    {
      "bio": "Rated a four-star recruit by Rivals.com and Scout.com, Hollins proved himself a formidable pass rusher in high school. As a senior, he recorded 76 tackles, including 44 for a loss and 24 sacks. Mora praised Hollins’ ability to get off at the snap quickly. He could see playing time early and contend for a starting spot by the season’s end.",
      "name": "Deon Hollins"
    },
    {
      "bio": "A season after just about coming out of nowhere to earn All-Pac-12 First Team honors at outside linebacker, Barr returns with even higher expectations. He recorded 21.5 tackles for loss last season, more than double the next highest returner, Marsh. Anticipate more Pac-12 teams double-teaming Barr, who reportedly ran a 4.46 40-yard dash this offseason.",
      "name": "Anthony Barr"
    },
    {
      "bio": "Orjioke is one of three players on the Bruins’ roster from the state of Georgia, where he had a productive career as a safety and linebacker. Orjioke grew up in Irvine and his desire to return to Southern California played a role in his decision to become a Bruin. At UCLA, he initially began preseason camp with the safeties but was moved over to work with the linebackers after gaining considerable strength in the offseason before his freshman year. As a freshman, he played in five games on special teams and as a backup linebacker and got two tackles.",
      "name": "Kenny Orjioke"
    },
    {
      "bio": "Coming out of high school, Olaniyan was a highly sought after prospect from Woodberry Forest School in Virginia. During his first year as a Bruin, Olaniyan was redshirted and was named the special teams winner of UCLA’s Charles Pike Memorial Award for Outstanding Scout Team Player. The next season Olaniyan appeared in 13 games off the bench, seeing time at defensive end, linebacker and on special teams. In 2012, he again played only as a reserve and on special teams.",
      "name": "Aramide Olaniyan"
    },
    {
      "bio": "Playing opposite Kendricks last season, Zumwalt recorded the team’s fourth-highest tackle total with 71. Chipping in with eight tackles for loss, two of those being sacks in 2012, Zumwalt’s 17 career starts provides UCLA’s defense with much-needed experience on the inside.",
      "name": "Jordan Zumwalt"
    },
    {
      "bio": "Hofmeister came to UCLA in the spring of 2011 as a junior college transfer from Riverside City College. Despite his early enrollment, Hofmeister never saw the field in 2011. In 2012, however, he played in 13 games and got two starts, finishing the year with 15 tackles. Hofmeister was voted a team captain by his teammates in 2013.",
      "name": "Ryan Hofmeister"
    },
    {
      "bio": "As a high school senior, Lagace had 45 tackles, one interception and a forced fumble. After redshirting last season, he is unlikely to see much playing time this year.",
      "name": "Taylor Lagace"
    },
    {
      "bio": "After missing much of fall camp while recovering from a minor ankle procedure, Kendricks is ready to once again be the Bruins’ defensive workhorse in 2013. Last season, Kendricks led the Bruins and the Pac-12 with 150 tackles, UCLA’s highest total in that category since 1978. A captain in 2013, Kendricks hopes to improve on that total once again this year.",
      "name": "Eric Kendricks"
    },
    {
      "bio": "Savaiinaea played his high school ball at Honolulu’s Punahou School, which produced fellow linebacker and current San Diego Charger Manti Te’o. Despite following in Te’o’s large footsteps, Savaiinaea made a name for himself in high school, earning a four-star ranking from Scout.com, which also ranked him the No. 53 player in the country. With two veterans already starting at middle linebacker, Savaiinaea could see limited time in a reserve role this season.",
      "name": "Isaako Savaiinaea"
    },
    {
      "bio": "After contributing on special team in 2010 and 2011, Bowens missed last season with a knee injury during spring practice. He will look to rebound from that injury this year. During his redshirt year in 2009, he was a defensive co-recipient of UCLA’s Charles Pike Memorial Award for Outstanding Scout Team Player.",
      "name": "Isaiah Bowens"
    },
    {
      "bio": "Porter had a stellar high school career. In addition to great football talent, he had great promise as a baseball player and was named the league MVP his senior year. Porter was the No. 34 recruit in California, according to Rivals.com and totaled 172 tackles his senior year.",
      "name": "Aaron Porter"
    },
    {
      "bio": "Playing on a struggling Beverly Hills High School squad that finished 2-8 his senior year in 2011, Green walked on at UCLA with good size and having flashed some ability on both sides of the ball in high school. Green played at wide receiver and linebacker. Green redshirted last year.",
      "name": "Willie Green"
    },
    {
      "bio": "Judge, rated a four-star recruit by Scout.com played for Oaks Christian High School in Westlake Village, Calif. He finished his senior season with 62 tackles and two sacks, while also playing running back on offense, where he ran for 72 yards and a touchdown.",
      "name": "Cameron Judge"
    },
    {
      "bio": "Returning with a healthy shoulder after requiring a procedure just three games into last season is Adams. A bit undersized for a corner, Adams makes up for it with impressive lateral quickness and vertical jump. Avoiding pass interference penalties, a big problem for UCLA’s defense last year, will be key for the young Adams.",
      "name": "Ishmael Adams"
    },
    {
      "bio": "After some questions about his academic eligibility, Willis was cleared to play by the NCAA at the start of fall camp. Although Willis will likely not start to begin the season, he will probably get playing time in nickel packages and could push for a starting corner spot by the end of the season. Willis was regarded as a five-star recruit by Scout.com, which also ranked him as the No. 4 cornerback in the country.",
      "name": "Priest Willis"
    },
    {
      "bio": "Coming off a redshirt year, Combs was a highly ranked prospect within the state of New York, and chose to come all the way across the country to UCLA. He has been designated as a cornerback for college play, although he spent most of high school at quarterback. He garnered many accolades at Iona Prep, with all-league and All-America designations. His recruitment and scholarship sparked a major debate, in that his father is hip-hop mogul Sean Combs.",
      "name": "Justin Combs"
    },
    {
      "bio": "Perhaps the surprise of this team in fall camp, Moreau earned himself a starting secondary job during fall camp just a year after the coaching staff decided to move him from running back. Even against some of the team’s best receivers, Moreau showed great anticipation and route coverage, picking off a number of passes in San Bernardino. For Adams and Moreau both, though, freshman corner Priest Willis, likely a nickel player for now, is not far behind.",
      "name": "Fabian Moreau"
    },
    {
      "bio": "Coming from Diamond Ranch High School in nearby Pomona, Sermons was expected to make an immediate impact upon his arrival in Westwood. However, after playing in nine games as a freshman, Sermons fractured his left femur during spring practice of 2010, missing the entire year. Sermons played in 12 games in 2011 and nine games in 2012 on both defense and special teams. He will be vying for playing time in the secondary this season.",
      "name": "Brandon Sermons"
    },
    {
      "bio": "Dawson is a freshman defensive back from Windward School in Los Angeles. He could see limited time as a backup cornerback this year.",
      "name": "Charles Dawson"
    },
    {
      "bio": "Johnson, a Fresno, Calif. native, figured to play a part in the rebuilt UCLA secondary before a shoulder injury during fall camp, one that will likely require season-ending surgery. Johnson comes to Westwood ranked by Scout.com as the No. 8 cornerback in the nation. In 13 games as a senior at Central High School, Johnson finished the year with 42 tackles and eight interceptions.",
      "name": "John Johnson"
    },
    {
      "bio": "Rios played in nine game in 2012, on both special teams and as a backup defensive back, finishing with three tackles on the year. Rios is expected to miss the season as he recovers from a rare fungal infection in his sinuses that required at least six surgeries since last October. Should he return to full health next year, Rios figures to play a role in a secondary lacking depth. He was rated a four-star recruit by both Rivals.com and Scout.com in high school.",
      "name": "Marcus Rios"
    },
    {
      "bio": "Zumwalt has yet to see the field after being redshirted two years ago. Zumwalt is the younger brother of starting linebacker Jordan Zumwalt. He played at Edison High School in Huntington Beach.",
      "name": "Erick Zumwalt"
    },
    {
      "bio": "Described as both long and versatile by coach Jim Mora, Jefferson’s athleticism helped earn him a starting job as a safety after spending much of his time throughout his UCLA career, particularly this past spring, at cornerback. It appears now that Jefferson, who has missed a lot of time as a Bruin due to injury, is finally healthy and able to play regularly, a relief to a UCLA coaching staff that knows its secondary doesn’t have many bodies.",
      "name": "Anthony Jefferson"
    },
    {
      "bio": "Goodman, who hails from Rancho Cucamonga, Calif., is another of UCLA’s highly touted defensive back freshmen. Rated a four-star recruit by Scout.com and Rivals.com, Goodman played in the U.S. Army All-American Bowl all-star game, where he recorded five tackles. With a depleted secondary, Goodman could see some time as a backup this season.",
      "name": "Tahaan Goodman"
    },
    {
      "bio": "Brown, rated a three-star recruit by Rivals.com and Scout.com, has two veterans ahead of him on the depth chart, but Mora spoke highly of him in the preseason, saying he could still see some playing time.",
      "name": "Jayon Brown"
    },
    {
      "bio": "Randall Goforth has five starts at safety to his credit, which, ironically enough, makes him the secondary’s most experienced starter. Recording 40 tackles and hauling in an interception as a freshman last year, Goforth’s status as the starter at this safety position was never really in question throughout the fall, despite Mora saying he had “no clue” who would fill out his starting secondary at Pac-12 media day.",
      "name": "Randall Goforth"
    },
    {
      "bio": "In 2012, McKay played in all 14 games as a backup in the secondary and linebacker, as well as on special teams. His 34 tackles were the 13th most on the team.",
      "name": "Stan McKay"
    },
    {
      "bio": "A freshman from Crespi High School in Pasadena, Calif., Foreman was rated a four-star recruit by both Rivals.com and Scout.com. As a senior, he registered 39 tackles, five interceptions, three forced fumbles and two fumble recoveries. Despite his talent, Mora did not list him as one of the freshmen who he expects to see significant playing time this season.",
      "name": "Tyler Foreman"
    },
    {
      "bio": "A Loyola High School alum, Barocio initially redshirted his first season as a Bruin. After playing on the scout team for a year, Barocio saw action on the field as a member of the special teams unit during his redshirt freshman year. After the 2011 season, Barocio tore his anterior cruciate ligament during spring practice. However, refusing to let the injury hinder his progress, Barocio was seen doing pushups on the sidelines and working out however he could, citing his ambition to become the player to come back from such an injury quicker than anyone else. He missed the 2012 season because of injury, but could see playing time on special teams this year.",
      "name": "Librado Barocio"
    },
    {
      "bio": "While it’s still undetermined whether he’ll be handed Jeff Locke’s kickoff duties in addition to punting, the early portion of fall camp showed how much promise the young Covington has as a punter. Coming out of the gate as a freshman starter, Covington clearly has the leg for the job and then some, but his biggest challenge, which may be perfected with age, will be downing teams consistently inside the 20 yard line.",
      "name": "Sean Covington"
    },
    {
      "bio": "Searl is a freshman punter from Irvine, Calif. He will be the backup punter this season.",
      "name": "Adam Searl"
    },
    {
      "bio": "Fairbairn’s UCLA career got off to a tough start last season, his first three PAT attempts being blocked. That being said, his first season with the Bruins ended on a high note, as he ended the 2012 campaign with only one miss inside 35 yards on his record. Being able to make field goals regularly outside of 40 yards, though, will be the key to the Bruins capitalizing on non-touchdown drives and not having to go for it on fourth down.",
      "name": "Ka’imi Fairbairn"
    },
    {
      "bio": "Johnson, who attended the same high school as teammate Myles Jack, redshirted last year. With Ka’imi Fairbairn seemingly the kicker for the next three years, Johnson isn’t likely to see much, if any, field time.",
      "name": "Mitch Johnson"
    },
    {
      "bio": "Still the team’s backup quarterback, and a year removed from being the scout team quarterback, Neuheisel takes on the kneeling position to replace yet another of Jeff Locke’s important duties. A well-performing holder is one that goes unnoticed during special teams plays, and so far, Neuheisel has received snaps from Christopher Longo the best of his abilities.",
      "name": "Jerry Neuheisel"
    },
    {
      "bio": "Fairbairn’s UCLA career got off to a tough start last season, his first three PAT attempts being blocked. That being said, his first season with the Bruins ended on a high note, as he ended the 2012 campaign with only one miss inside 35 yards on his record. Being able to make field goals regularly outside of 40 yards, though, will be the key to the Bruins capitalizing on non-touchdown drives and not having to go for it on fourth down.",
      "name": "Ka’imi Fairbairn"
    },
    {
      "bio": "While it’s still undetermined whether he’ll be handed Jeff Locke’s kickoff duties in addition to punting, the early portion of fall camp showed how much promise the young Covington has as a punter. Coming out of the gate as a freshman starter, Covington clearly has the leg for the job and then some, but his biggest challenge, which may be perfected with age, will be downing teams consistently inside the 20 yard line.",
      "name": "Sean Covington"
    },
    {
      "bio": "Now in his third year with the program, Longo faces the difficult task of replacing the incredibly-consistent Kevin McDermott, who has been battling Brian Jennings of the San Francisco 49ers for a starting job throughout the offseason and was considered one of the NCAA’s best long snappers a season ago. Holding the job since spring, Longo’s consistency was called into question as recently as Friday by Mora.",
      "name": "Christopher Longo"
    },
    {
      "bio": "Hailing from Maryland, Hajimihalis will serve as a backup to starter Christopher Longo. He played at St. Paul’s School in Brooklandville, Maryland.",
      "name": "Peter Hajimihalis"
    },
    {
      "bio": "Yards-wise, Evans returns for his third season with UCLA as the Bruins’ leading 2012 receiver, hauling sixty passes, also a team-high, for 877 yards. As he looks to break the 1,000-yard barrier for the first time in his career, his biggest area of improvement will likely be touchdowns, of which he had just three last season.",
      "name": "Shaquelle Evan"
    },
    {
      "bio": "Expect Fuller, now a year solidified into his slot receiver position after playing quarterback for much of his life, to have a breakout season in 2013. Despite only amassing 145 yards receiving and two touchdowns last season, Fuller’s quickness and precise route running should serve him well as he goes over the middle more this season.",
      "name": "Devin Fuller"
    },
    {
      "bio": "Manfro saw significant playing time as a redshirt freshman last season. He returned punts and kicks, as well as getting snaps as a slot receiver. Manfro hauled in 28 receptions, good for fifth on the team. He struggled at times with fumbles as a returner, however.",
      "name": "Steven Manfro"
    },
    {
      "bio": "Randall Goforth has five starts at safety to his credit, which, ironically enough, makes him the secondary’s most experienced starter. Recording 40 tackles and hauling in an interception as a freshman last year, Goforth’s status as the starter at this safety position was never really in question throughout the fall, despite Mora saying he had “no clue” who would fill out his starting secondary at Pac-12 media day.",
      "name": "Randall Goforth"
    },
    {
      "bio": "Returning with a healthy shoulder after requiring a procedure just three games into last season is Adams. A bit undersized for a corner, Adams makes up for it with impressive lateral quickness and vertical jump. Avoiding pass interference penalties, a big problem for UCLA’s defense last year, will be key for the young Adams.",
      "name": "Ishmael Adams "
    },
    {
      "bio": "Manfro saw significant playing time as a redshirt freshman last season. He returned punts and kicks, as well as getting snaps as a slot receiver. Manfro hauled in 28 receptions, good for fifth on the team. He struggled at times with fumbles as a returner, however.",
      "name": "Steven Manfro"
    },
    {
      "bio": "By ending up at UCLA, Perkins once again ended up at the same school as a former classmate, quarterback Brett Hundley. Perkins was a three star recruit (Rivals/Scout.com), who gained first-team All-State recognition at home in Arizona in his senior year. After redshirting last year, Perkins figures to play a large role in UCLA’s running back by committee approach this season.",
      "name": "Paul Perkins"
    },
    {
      "bio": "Jack, who also played running back at Bellevue High School in Bellevue, Wash., was rated a four-star recruit by both Rivals and Scout. He recorded five tackles in the U.S. Army All-American Bowl Game. Jack looked impressive during fall camp, prompting Mora to say he anticipated Jack seeing a fair amount of playing time this season, possibly used to help cover receivers.",
      "name": "Myles Jack"
    },
    {
      "bio": "After not seeing any game action in 2011, Davis played in 12 games last season on special teams. In 2011, his efforts as a Bruin were rewarded when he received the Charles Pike Memorial Award for Outstanding Scout Team Player (special teams).",
      "name": "Roosevelt Davis"
    }
  ]
}