{
  "date-generated" : "August 26, 2012, 11 p.m.",
  "players" : [
    {
      "bio" : "Because the Bruins had a deep veteran receiving corp last season, the coaching staff opted to redshirt Lucien. Much of that group graduated in June, making way for Lucien to come in and make an impact right away. Lucien figures to come in as the first wideout off of the bench with the possibility of starting.",
      "bullets" : [
        "As a senior at Crespi Carmelite High School, Lucien grabbed 71 receptions for 1,259 yards and 18 touchdowns."
      ],
      "name" : "Devin Lucien"
    },
    {
      "bio" : "Manfro is one of many redshirt freshmen looking to do more than just find a place on the field this season. Manfro has shown superior agility that can spring him for big plays, and he will get the bulk of the reps at the F-receiver slot position.",
      "bullets" : [
        "Out of Valencia High School, Manfro received only two scholarship offers, one from UCLA and one from Wyoming.",
        "In his senior year, Manfro had 29 rushing touchdowns and rushed for 2,553 yards. He also had 41 receptions for 844 yards and 10 touchdowns.",
        "Manfro was last season’s Offensive Scout Team Player of the Year."
      ],
      "name" : "Steven Manfro"
    },
    {
      "bio" : "Marsh’s 6-foot-3, 275-pound frame makes him an ideal fit for the Bruins’ new 3-4 defensive scheme. With the transitioning of Damien Holmes from defensive line to linebacker, Marsh figures to get consideration to start this year and will likely see a lot of playing time.",
      "bullets" : [
        "In 12 games last season, Marsh accumulated 22 tackles, fourth amongst UCLA’s defensive linemen. He registered two sacks in 2011.",
        "He won two CIF state championships at Oaks Christian High School.",
        "Marsh played in the U.S. Army All-American Bowl as a senior in high school.",
        "Marsh was named to the Hendricks Award watch list for the nation’s best defensive end."
      ],
      "name" : "Cassius Marsh"
    },
    {
      "bio" : "Last season, Marvray played in 13 games but had a limited impact, only averaging 5.7 yards per catch with a long reception of 11 yards. Marvray was a sprinter in high school and may be an option to open up defenses with his speed on the outside. Whether or not Marvray starts, he figures to see the field plenty just as he has the last two years.",
      "bullets" : [
        "In 2011, Marvray had 10 catches for 57 yards.",
        "As a senior at Centennial High School, he had 71 catches for 1,256 yards and 13 touchdowns."
      ],
      "name" : "Ricky Marvray"
    },
    {
      "bio" : "Mazzone is the son of UCLA’s new offensive coordinator, Noel Mazzone. He also has a brother on the coaching staff, Taylor Mazzone, a graduate assistant special teams coach. Mazzone is a recent transfer from East Carolina, where he played as wide receiver but saw no action in live games.",
      "name" : "Grayson Mazzone"
    },
    {
      "bio" : "McCarthy was arguably the Bruins’ most significant signing of the 2012 recruiting class, but there’s no doubt that he was the biggest. The 6-foot-5, 330-pound defensive lineman enters his freshman season poised to become a starter and will likely have an impact. McCarthy dominated offensive linemen in high school with his massive size but also has athleticism and agility that can make him a force on the front line for UCLA this season. McCarthy will likely play defensive end in the 3-4 defensive scheme.",
      "bullets" : [
        "Rivals.com ranked McCarthy No. 21 overall, and Scout.com ranked him as the No. 2 defensive tackle in the country.",
        "In his senior year at Monrovia High School, McCarthy registered 55 tackles, five sacks and added three fumble recoveries."
      ],
      "name" : "Ellis McCarthy"
    },
    {
      "bio" : "2012 marks McDermott’s first season with the Bruins. The true freshman offensive lineman hails from Nashville, Tenn., where he played for Ensworth High School. At 6 feet 8 inches, 247 pounds, McDermott has a large frame but would likely need to bulk up to compete for any playing time on the offensive line.",
      "bullets" : [
        "McDermott gray-shirted last season.",
        "McDermott is the younger brother of UCLA’s starting long snapper, Kevin McDermott."
      ],
      "name" : "Conor McDermott"
    },
    {
      "bio" : "2011 was McDermott’s first season as UCLA’s starting long snapper, a position he held down for all 14 games. McDermott will be the starter again this season. His brother, Conor, is a true freshman on the Bruins this season.",
      "name" : "Kevin McDermott"
    },
    {
      "bio" : "McDonald had a breakout season in 2011 when he took over the free safety position for the final 11 games of the season after Tony Dye went down with an injury. Although it was his first season on the field, the freshman played like a veteran. Despite only playing in 11 of the team’s 14 games, McDonald had UCLA’s fifth-most tackles. As a sophomore, McDonald figures to be an integral part of the Bruins’ defensive backfield.",
      "bullets" : [
        "Recorded 56 tackles in 2011 and added three interceptions",
        "Freshman All-American according to Yahoo! Sports and CBSSports.com",
        "His brother T.J. plays safety at USC.",
        "Had 68 tackles and seven interceptions in his senior season at Edison High School"
      ],
      "name" : "Tevin McDonald"
    },
    {
      "bio" : "In 2011, McKay played in 13 games for the Bruins and started twice. This season, with UCLA’s lack of depth at the safety positions, McKay will be a factor in the Bruins’ secondary and may compete for a starting spot.",
      "bullets" : [
        "Last season, McKay had 20 tackles while playing both defense and special teams.",
        "Had 62 tackles and nine interceptions in his senior year at Long Beach Poly"
      ],
      "name" : "Stan McKay"
    },
    {
      "bio" : "Odighizuwa came into UCLA as a highly touted prospect, ranked No. 8 in the country by Rivals.com, but has failed to make much of an impact. At 6 feet 3 inches, 270 pounds, his athleticism and size suggest that he may be able to break out if he learns to vary his moves on the defensive line. Odighizuwa will see time at the defensive end position in the 3-4 defensive scheme this year.",
      "bullets" : [
        "In the 2011 season, Odighizuwa recorded 21 tackles, including three tackles for losses.",
        "In his senior season at David Douglas High School, Odighizuwa had 90 tackles and 10 sacks."
      ],
      "name" : "Owamagbe Odighizuwa"
    },
    {
      "bio" : "After missing 2011 because of transferring from North Carolina, Willis will compete for time at the nose tackle position of UCLA’s 3-4 defense.",
      "bullets" : [
        "In his senior season at James F. Byrnes High School, Willis had 127 tackles and 13 sacks."
      ],
      "name" : "Brandon Willis"
    },
    {
      "bio" : "Wysocki was redshirted his first year in Westwood and will look to make his debut as a redshirt freshman. With injuries on the offensive line, Wysocki will compete for the starting guard spot on UCLA’s offensive line. His 6-foot-4, 295-pound frame gives him the size to handle himself in the trenches.",
      "bullets" : [
        "Played at Los Alamitos High School"
      ],
      "name" : "Ben Wysocki"
    },
    {
      "bio" : "Young is a redshirt sophomore who has yet to make it onto the field for the Bruins. He tore his achilles tendon and will not play this season.",
      "bullets" : [
        "Spent his high school career at Loyola High School"
      ],
      "name" : "John Young"
    },
    {
      "bio" : "Zumwalt has yet to see the field after being redshirted last year. Zumwalt is the younger brother of starting outside linebacker Jordan.",
      "bullets" : [
        "Played at Edison High School in Huntington Beach"
      ],
      "name" : "Erick Zumwalt"
    },
    {
      "bio" : "Zumwalt has made a consistent impact on the UCLA defense over the last two years and figures to do so again this year as an outside linebacker in the new 3-4 scheme. The switch to a 3-4 defense may help Zumwalt in rushing the passer, an area he fell short in last year, failing to reach opposing quarterbacks even once after doing so three times in 2010.",
      "bullets" : [
        "Had 60 tackles last season, third on the team and added an interception",
        "As a senior at Edison High School in Huntington Beach, Zumwalt recorded 164 tackles and 3.5 sacks."
      ],
      "name" : "Jordan Zumwalt"
    },
    {
      "bio" : "After not seeing any game action last year, Davis looks to emulate the success he had in high school at the collegiate level. Last season, his efforts as a Bruin were rewarded when he received the Charles Pike Memorial Award for Outstanding Scout Team Player (special teams).",
      "bullets" : [
        "As a senior at Paraclete High School, Davis had 116 rushes for 1048 yards."
      ],
      "name" : "Roosevelt Davis"
    },
    {
      "bio" : "Downey, who earned his first starting assignment in 2011, is expected to compete for serious playing time this year. After walking onto the team at 255 pounds, he has put on weight while retaining quickness, earning increased playing time as well as a scholarship. He appeared on the offensive line for two games last season, coming in as a backup against Colorado and starting at tackle in the Fight Hunger Bowl against Illinois.",
      "name" : "Brett Downey"
    },
    {
      "bio" : "Eaton is a true freshman Y-receiver from Los Altos High School.",
      "name" : "Daniel Eaton"
    },
    {
      "bio" : "Redshirt sophomore running back Emesibe has been steadily gaining attention since walking on during winter practice in 2010. After a promising high school career, which included being named to the first team Mojave River League, his senior season ended abruptly with a broken leg in his first game. But since sitting out his redshirt season, he’s had a good number of carries in spring practice, and spent much of camp returning punts. Emesibe joins a family legacy of collegiate football, as twin brother Galvin played defensive tackle at UC Davis and cousin Femi played cornerback at San Diego State.",
      "bullets" : [
        "Walked on during winter practice in 2010",
        "Did not appear in a game last season"
      ],
      "name" : "Melvin Emesibe"
    },
    {
      "bio" : "Epenesa, a junior, saw action in eight games last season, and seven in 2010, and is expected to compete for playing time at nose tackle this year. The 310-pound Hawaii native was credited with tackles in five games last year, and also spent time on special teams. Epenesa is expected to add solid depth to a line that is expected to be vital for the Bruins this year.",
      "bullets" : [
        "Had seven stops in eight games played last season"
      ],
      "name" : "Seali'i Epenesa"
    },
    {
      "bio" : "Evans, a redshirt junior wide receiver, returned to his hometown of Los Angeles by transferring to UCLA after a year playing at Notre Dame. ESPNU ranked Evans as the nation’s No. 4 wide receiver coming out of high school, but had only 7 receptions for 61 yards his freshman year. As a Bruin, however, he has been a steady presence, playing in 13 games and starting five last season.",
      "bullets" : [
        "Transferred from Notre Dame in 2010",
        "Had 19 receptions in the 2011 season"
      ],
      "name" : "Shaquelle Evans"
    },
    {
      "bio" : "Fafaul, a freshman quarterback from Cockeysville, Md., comes to UCLA as a preferred walk-on, but has already caught the public eye for his quick release and impressive accuracy. After graduation from high school with only a single offer from New Hampshire University, he chose to spend a year at Fork Union Military Academy building strength and skills. While at Fork Union, he quickly gained attention from a number of D1 schools on his path to an 8-1 record.",
      "bullets" : [
        "Had an 8-1 record in his year playing at Fork Union Military Academy"
      ],
      "name" : "Mike Fafaul"
    },
    {
      "bio" : "Fairbairn, a freshman kicker, hails from Honolulu’s esteemed Punahou School. His last two high school seasons, he was named first-team all-state and defensive player of the year by the Interscholastic League of Honolulu. Since graduation, he has gained praise for his consistency in both field goals and kickoffs.",
      "bullets" : [
        "Made 95 percent of kickoffs into end zone in senior season and made 13 of 18 field goal attempts"
      ],
      "name" : "Ka'imi Fairbairn"
    },
    {
      "bio" : "Fauria, a redshirt senior, is expected to excel this season, partly because of coordinator Noel Mazzone’s pass-heavy offense. After having played as a tight end, Fauria is listed this year as a Y-receiver, which will see him running routes out of the slot. He played in every game last season and had six scoring receptions – the most by a Bruin since 2005. His efforts earned him the Captain Don Brown Memorial award for Most Improved Offensive Player. The nephew of former NFL tight end Christian Fauria, Joseph Fauria is projected to be a second- or third-round pick in the 2013 NFL Draft.",
      "bullets" : [
        "Led the Bruins with six touchdown catches last year",
        "Saw action in all 14 games last season"
      ],
      "name" : "Joseph Fauria"
    },
    {
      "bio" : "Franklin, a redshirt senior running back and two-year starter, returns to UCLA as a key player after choosing to forego last year’s NFL draft. Last season, Franklin rushed for 976 yards, and was ranked 10th in the Pac-12 for rushing, but scored only five touchdowns. He is a two-time all-conference selection, chosen for his impressive speed and ability to skirt defenders in close quarters. As of the beginning of this season, Franklin is 1,062 yards shy of UCLA’s all-time rushing record and, despite a loaded Bruin backfield, is expected to be a primary offensive player and a top-five UCLA prospect for the 2013 NFL Draft.",
      "bullets" : [
        "1,062 yards shy of UCLA’s all-time rushing record",
        "Named to the Maxwell Award and Doak Walker Award watch lists in 2011"
      ],
      "name" : "Johnathan Franklin"
    },
    {
      "bio" : "After graduating early from high school, Millweard – a freshman quarterback – took part in spring practice with the Bruins. He was initially committed to Noel Mazzone at Arizona State, and elected to play for the offensive coordinator at UCLA over several other Division I offers. Millweard was rated the nation’s No. 5 high school quarterback by ESPN, after a senior year where he served as a team captain and completed 171 of 255 passes for 2,374 yards. He was also a four-year basketball letterwinner and three-year team captain.",
      "bullets" : [
        "Completed 171 of 255 passes in his final season as a high school quarterback"
      ],
      "name" : "T.J. Millweard"
    },
    {
      "bio" : "Despite battling a string of injuries – including concussions, a blown-out knee and various broken bones -  in his first three seasons at quarterback, Prince remains in the all-time career top 10 for completions, passing yards and total offense. The redshirt senior started in 10 games last season and threw for 12 touchdown passes, while also running for 424 yards – the most by a Bruin quarterback since 1976. After participating in a fierce quarterback race, Prince will not be the starting QB heading into this season.",
      "bullets" : [
        "Threw 12 touchdown passes last season",
        "Ran for 424 yards in 10 games"
      ],
      "name" : "Kevin Prince"
    },
    {
      "bio" : "Rice Jr. is a redshirt junior receiver who took the field for the first time last fall in the homecoming win against California, making one catch in the second quarter. Rice Jr. turned down offers from Kansas State and Air Force to play at UCLA, but has struggled to compete with a large pack of talented Bruin receivers and has spent most of his time playing on the scout team. The son of Jerry Rice, a living legend in the NFL, Rice Jr. has impressed coaches with his tenacity and was awarded a scholarship for the 2012 season.",
      "bullets" : [
        "Made one catch in his single game appearance against California last year"
      ],
      "name" : "Jerry Rice Jr."
    },
    {
      "bio" : "After sustaining a serious neck injury in last season’s homecoming game against Cal, Riley underwent surgery and will sit out the 2012 season as a medical redshirt. Before his injury, Riley – a junior safety – had a solid 2011 season, appearing in eight games with five starts. He had a particularly strong game against Arizona, where he was credited with a career-high eight tackles, including two tackles for loss. As a freshman, he received UCLA’s Ed Kezirian \"Coach K\" Award for Academic and Athletic Excellence.",
      "bullets" : [
        "Suffered a serious neck injury last year and will sit out the 2012 season"
      ],
      "name" : "Dietrich Riley"
    },
    {
      "bio" : "Rios, a freshman corner, was Mora’s first commitment after being hired, having formerly been committed to Boise State. He comes to UCLA as a four-star recruit and is considered one of the top five corners on the West Coast. Despite concerns over his relatively small size – Rios stands at 6 feet and 185 pounds – he is expected to compete for playing time immediately.",
      "bullets" : [
        "Considered one of the top five cornerback recruits on the West Coast"
      ],
      "name" : "Marcus Rios"
    },
    {
      "bio" : "Ruhl is a redshirt sophomore fullback, considered fourth in line for the position this season. After entering UCLA as a preferred walk-on, his role so far as a Bruin has been primarily to provide depth and play with the scout team. Ruhl looks to continue a strong family tradition of football – his brother Nicolas played at Stanford and grandfather Alex Spanos is the owner of the San Diego Chargers.",
      "bullets" : [
        "Has participated primarily as a scout team player"
      ],
      "name" : "Phillip Ruhl"
    },
    {
      "bio" : "Fuller has the ability to play any number of roles in college. Fuller is currently listed as a quarterback and would like to stay there, but showed off his versatility during summer camp in San Bernardino when he spent time returning punts. Though he may be a year or two away from contributing significantly, Fuller’s athletic ability makes it easy to believe he’ll find his way onto the field soon enough.",
      "bullets" : [
        "Fuller was ranked the No. 3 quarterback in the nation by Scout.com.",
        "Fuller was ranked the No. 3 quarterback in the nation by Scout.com.",
        "Tom Lemming and Superprep All-American out of Northern Valley Regional High School in Old Tappan, N.J.",
        "Finished with 118 total touchdowns in high school career, passing for 58 and rushing for 60"
      ],
      "name" : "Devin Fuller"
    },
    {
      "bio" : "Hailing from Edison High School in Huntington Beach, Gane is one of four players who transitioned from other positions to play fullback in offensive coordinator Noel Mazzone’s offense. Gane played sparingly last season, seeing time on special teams, but had been playing at tight end. With the move away from the pistol offense employed by the previous coaching staff, a need for fullbacks prompted the switch for Gane.",
      "bullets" : [
        "Gane played every game his senior year of high school after sitting out his entire junior year because of a rare disorder called aplastic anemia.",
        "As a senior at Edison, Gane served as a team captain, was a first-team All-Sunset League selection and was named Most Inspirational by the team.",
        "Came to UCLA as a preferred walk-on"
      ],
      "name" : "Luke Gane"
    },
    {
      "bio" : "Hailing from Southern California powerhouse Long Beach Poly High School, Goforth brings a winning pedigree to Westwood. Goforth was a talented two-way player in high school though he made most of his impact felt on the defensive side of the ball. He was one of a host of Long Beach Poly players to commit to Arizona State early in the recruiting process, but Goforth ended up signing for UCLA on National Signing Day, Feb. 1, 2012. He projects well as a cornerback, though many recruiting services liked his potential as a wide receiver. Goforth will likely not see much playing time this season, barring a rash of injuries, as he grows and matures into the college game.",
      "bullets" : [
        "Nation’s No. 25 cornerback coming out of high school, according to Scout.com",
        "Nation’s No. 45 wide receiver and a four-star prospect coming out of high school, according to ESPN - As a senior, recorded 79 tackles, four interceptions and one fumble recovery"
      ],
      "name" : "Randall Goforth"
    },
    {
      "bio" : "Offensive line coach Adrian Klemm was very happy to secure Goines’ commitment to the Bruins. Listed as the second-tallest, at 6-foot-7, and second-heaviest, at 324 pounds, player on the UCLA roster, Goines is a monster athlete from Texas. He lettered in both track and basketball in addition to football during high school and could see time this season along the offensive line, primarily at offensive tackle. Goines represents one of the key offensive line recruits brought in by Klemm during the team’s furious rush to National Signing Day.",
      "bullets" : [
        "A three-star recruit and the nation’s No. 37 offensive tackle coming out of high school, according to Scout.com",
        "A three-star recruit and the nation’s No. 56 offensive tackle coming out of high school, according to ESPN",
        "Cousin of former NFL running back Tiki Barber and current NFL safety Ronde Barber"
      ],
      "name" : "Simon Goines"
    },
    {
      "bio" : "Coming to UCLA from Arcadia, Golper was considered one of the top middle linebackers in the country. He played all four years at Arcadia, including basketball for three years. Since coming to UCLA, Golper has played little, seeing the field for the first time last year as a special teams contributor. With the medical retirement of inside linebacker Patrick Larimore, Golper could be in line for an increase in playing time whether as a starter or reserve.",
      "bullets" : [
        "As a high school junior, Golper totaled 11 sacks and had 122 tackles for the Arcadia Apaches.",
        "Nation’s No. 9 middle linebacker coming out of high school, according to Scout.com",
        "Played in 12 games for the Bruins in 2011, recording two tackles"
      ],
      "name" : "Todd Golper"
    },
    {
      "bio" : "The Las Vegas native will be one of the many players transitioning to a new position this season. After playing primarily as a defensive end in the 4-3 defense, Graham now moves to outside linebacker in the team’s new 3-4 defense. Graham started seven games over the past two seasons, and will still be charged with getting after the passer only now standing up.",
      "bullets" : [
        "Career-high six tackles against Illinois in his only start of 2011",
        "Has recorded four sacks in his career, including three in six starts in 2010",
        "Nation’s No. 6 defensive end and No. 1 in the West coming out of high school, according to Scout.com"
      ],
      "name" : "Keenan Graham"
    },
    {
      "bio" : "Playing on a struggling Beverly Hills High School squad that finished 2-8 his senior year, Green walks-on at UCLA with good size and having flashed some ability on both sides of the ball in high school. Green played at wide receiver and linebacker. It is highly unlikely Green will see time this season.",
      "bullets" : [
        "Accounted for 55 tackles as a senior in high school",
        "Caught 18 passes for 454 yards and three touchdowns as a senior at Beverly Hills",
        "162 yards receiving in 20-14 win over San Marcos as a senior"
      ],
      "name" : "Willie Green"
    },
    {
      "bio" : "Hailing from Maryland, Peter Hajimihalis will serve as the primary backup long snapper to starter Kevin McDermott. He played at St. Paul’s High School in Brooklandville, Md.",
      "bullets" : [
        "Named to winter 2012 Athletic Director’s Honor Roll",
        "Redshirted in 2011",
        "Wore No. 50 as a senior at St. Paul’s High School"
      ],
      "name" : "Peter Hajimihalis"
    },
    {
      "bio" : "Originally playing on the defensive side of the ball, Tre’ Hale made the switch to offensive guard during spring camp. Hale prepped locally at Damien High School in La Verne where he played on both the offensive and defensive lines. He also participated in the San Gabriel Valley Hall of Fame All-Star game. Hale has yet to see action in a game, but provides the team with depth along the offensive line.",
      "bullets" : [
        "Served as defensive captain senior year at Damien and was named the team’s Defensive Player of the Year in 2009",
        "Recorded 27 tackles and one sack as a senior",
        "Participated in track and field during high school, competing in the California Interscholastic Federation playoffs"
      ],
      "name" : "Tre’ Hale"
    },
    {
      "bio" : "A three-time letterman in football at Barrington High School in Indiana, Sam Handler comes to UCLA trying to stay on the roster at the wide receiver spot. Handler played in the spring game at the Rose Bowl this year. He has a brother who also plays college football at Pac-12 South counterpart Colorado. It is highly unlikely Handler will see much time this season with the amount of receiving depth the Bruins have.",
      "bullets" : [
        "Served as a team captain as a senior in high school",
        "Had 45 catches for 500 yards receiving his senior year",
        "Also lettered once in basketball and baseball"
      ],
      "name" : "Sam Handler"
    },
    {
      "bio" : "Playing at Western High School in Florida, Fabian Moreau made a huge impact both as a wide receiver and running back. Moreau possess qualities that should fit very well in Noel Mazzone’s offense, especially operating out of the slot. He has good speed and hands, and should be able to make an impact at some point in his college career.",
      "bullets" : [
        "Three-star recruit coming out of high school, according to Scout.com and Rivals.com",
        "As a senior, Moreau accounted for 11 rushing touchdowns and seven receiving touchdowns",
        "As a senior, Moreau served as a team captain and was named team MVP"
      ],
      "name" : "Fabian Moreau"
    },
    {
      "bio" : "Having also been a part of the UCLA baseball program, Scott burst onto the scene for the Bruin football team with a big spring game performance. Scott scored on touchdown passes of 41 yards, from Brett Hundley, and 63 yards, from Richard Brehaut, to finish with three catches for 113 yards and two scores. After redshirting last year, Scott has the opportunity to break into the receiver rotation this year though he will likely have to unseat one or two talented freshmen wide receivers from this year’s recruiting class.",
      "bullets" : [
        "Scott was selected in the 41st round of the 2011 MLB Draft by the Texas Rangers.",
        "As a junior at Marin Catholic High School, Scott accounted for 13 touchdowns on offense.",
        "Caught 82-yard touchdown pass in 2009 CIF state bowl game against Gardena Serra that set record for longest pass in game’s history"
      ],
      "name" : "Tyler Scott"
    },
    {
      "bio" : "Coming from Diamond Ranch High School in nearby Pomona, Sermons was expected to make an immediate impact upon his arrival in Westwood. However, after playing in nine games as a freshman, Sermons fractured his left femur during spring practice of 2010, missing the entire year. Sermons played in 12 games in 2011 on both defense and special teams, and will be vying for playing time in the secondary this season.",
      "bullets" : [
        "Rated No. 28 prospect in California and a four-star recruit coming out of high school, according to Rivals.com",
        "Nation’s No. 33 cornerback coming out of high school, according to Rivals.com and ESPN",
        "As a high school senior, he had 51 tackles in 12 games."
      ],
      "name" : "Brandon Sermons"
    },
    {
      "bio" : "After a tremendous start to his UCLA career, starting all 13 games as a freshman at left tackle, Su’a-Filo missed the last two seasons while away on a Mormon mission. Su’a-Filo has since returned to the team after enrolling in the 2012 winter quarter and few things have changed as he is again slated to start at left tackle this season. He was listed as the starter at left tackle following spring practice and will now be counted on to anchor the offensive line.",
      "bullets" : [
        "Co-winner of John Boncheff, Jr. Memorial team award for Rookie of the Year in 2009",
        "Earned Honorable Mention All-Pac-10 honors as a freshman",
        "Nation’s No. 35 prospect and No. 3 offensive tackle coming out of high school, according to ESPN"
      ],
      "name" : "Xavier Su’a-Filo"
    },
    {
      "bio" : "Out of Santa Margarita Catholic High School, Sweet provides nice depth for the Bruins at receiver. After redshirting last year, Sweet was listed as the Bruins’ third-string Z receiver at the end of spring by coach Jim Mora. Sweet caught a 15-yard touchdown pass from quarterback Kevin Prince during the spring game. He will have to fight off a few other receivers this season for playing time on offense.",
      "bullets" : [
        "As a senior in high school, Sweet had 34 receptions for 733 yards and 11 touchdowns.",
        "Participated in track and field in high school",
        "Unranked prospect according to Rivals.com and Scout.com coming out of high school"
      ],
      "name" : "Logan Sweet"
    },
    {
      "bio" : "Tai not only starred as a defensive end in high school, but also played at quarterback and tight end at Liberty High School in Las Vegas. Tai graduated early from high school to attend UCLA early last year. He was likely to see time at defensive line this season before tearing his Achilles tendon.",
      "bullets" : [
        "Three-star recruit coming out of high school, according to Scout.com and ESPN",
        "As a senior in high school, Tai registered 70 tackles and 15 sacks in just eight games because of a foot injury.",
        "Cousin is NFL star Haloti Ngata of the Baltimore Ravens."
      ],
      "name" : "Sam Tai"
    },
    {
      "bio" : "Christopher Longo will be UCLA’s backup long snapper this season. As a redshirt freshman, he will work primarily behind Kevin McDermott, but once McDermott graduates it is assumed Longo will be the starter.",
      "bullets" : [
        "Longo attended local high school St. Francis in La Canada."
      ],
      "name" : "Christopher Longo"
    },
    {
      "bio" : "While known primarily for his last name, Neuheisel has stepped up to be one of the top quarterbacks for the Bruins. The son of former UCLA head coach Rick Neuheisel, Jerry was in the competition for the starting job this season from day one. He will provide valuable depth at the quarterback position this year as a true freshman.",
      "bullets" : [
        "Both of his parents attended UCLA.",
        "Neuheisel was the starting quarterback both his junior and senior seasons at Loyola High School where he threw for over 2,000 yards."
      ],
      "name" : "Jerry Neuheisel "
    },
    {
      "bio" : "Walker was one of the best surprises for UCLA during this year’s fall camp in San Bernardino. Walker is an electric athlete with great hands; he could see time this season as a true freshman. In high school Walker played wide receiver, running back, quarterback, punter and kick returner.",
      "bullets" : [
        "Walker was a high school state finalist in hurdles his sophomore through senior year.",
        "He was considered a three-star recruit by every major recruiting service coming out of high school."
      ],
      "name" : "Kenny Walker"
    },
    {
      "bio" : "After graduating high school early to attend UCLA as an early entry, Wallace spent last season as a redshirt. This year, Wallace will be a huge part of a thin linebacking corps from the outside linebacker position.",
      "bullets" : [
        "Wallace was a PrepStar All-Region selection.",
        "His father, Aaron Wallace Sr., was an All-American linebacker at Texas A&M before going on to play eight years in the NFL."
      ],
      "name" : "Aaron Wallace"
    },
    {
      "bio" : "White is a big, athletic offensive tackle who will see a lot of playing time this season as a redshirt freshman. Standing at 6 feet 5 inches and 285 pounds, White is slotted to start at the right tackle position for the Bruins.",
      "bullets" : [
        "White was a PrepStar All-Region selection out of Lakewood High School.",
        "He also played basketball and volleyball in high school."
      ],
      "name" : "Torian White"
    },
    {
      "bio" : "While only a freshman, Williams is easily UCLA’s tallest receiver standing at 6 feet 5. Because of his height, there is a good chance that Williams will see the field early at UCLA as a way to create mismatches for smaller defensive backs.",
      "bullets" : [
        "Williams was an all-state honoree in track and field out of high school.",
        "Williams attended Chandler High School, the same alma mater as UCLA’s starting quarterback Brett Hundley."
      ],
      "name" : "Javon Williams"
    },
    {
      "bio" : "James is one of the most versatile players on offense for the UCLA Bruins. James came into UCLA as a highly touted running back, but has since developed into a receiver with the ability to catch the ball out of the backfield or split out wide. He also will help UCLA in special teams as a returner. James redshirted his first year in Westwood and spent most of last year as an F-back in the pistol offense. This year, look for James to get a lot more time out of the slot where he will be a playmaker for the Bruins out in space.",
      "bullets" : [
        "James gained 190 total yards last season and scored one touchdown.",
        "He was ranked as the No. 38 player overall in the ESPN 150 out of high school.",
        "James attended Corona High School where he was team MVP as a junior and senior.",
        "James was selected to play in the Under Armor All-America game as a senior."
      ],
      "name" : "Jordon James"
    },
    {
      "bio" : "After spending his first two seasons in Westwood battling injuries, Jefferson is healthy and looking to be a big contributor in UCLA’s defensive backfield. Jefferson is listed as a cornerback, but has the size to play some safety if needed. Now a redshirt sophomore, Jefferson will have the opportunity to compete for playing time at all four defensive back positions thanks to his blend of size and speed.",
      "bullets" : [
        "In high school, Jefferson played both ways as a cornerback and a wide receiver.",
        "As a senior at Cathedral High School, Jefferson tallied 42 tackles and two interceptions on defense while racking up 1,286 receiving yards and 15 touchdowns on offense."
      ],
      "name" : "Anthony Jefferson"
    },
    {
      "bio" : "A once highly touted prospect out of high school, Johnson has had a tumultuous career while at UCLA. Injuries have prevented him from having the opportunity to break out, but this year looks to be his year. As a redshirt senior, Johnson is slotted to be one of the team’s starting wide receivers where he will use his big 6-foot-3, 211-pound frame to create mismatches on offense. Johnson is the oldest player in the receiving corps, making him an important leader for the Bruins this season.",
      "bullets" : [
        "Johnson had five catches for 57 yards in 2010 before breaking his ankle.",
        "Coming out of high school, Johnson was rated as a four-star by Rivals.com, which ranked him as the No. 33 receiver in the class."
      ],
      "name" : "Jerry Johnson"
    },
    {
      "bio" : "Jones is undeniably one of UCLA’s top talents for the 2012 season. Jones, a redshirt senior, has been considered a potential NFL talent since his sophomore season. The defensive end was a starter for his sophomore campaign and has been the starter every game he’s played since then. UCLA will look to Jones to be a leader of the defense both on and off the field this year.",
      "bullets" : [
        "Last season, Jones led the team with 6.5 tackles for loss and three sacks.",
        "As a true freshman, he was named to the All-Pac-10 Freshman team.",
        "As a true sophomore, Jones had four sacks and 11 tackles for loss.",
        "Coming out of high school, Jones was considered one of the top defensive ends in the nation, earning four-star rankings from Rivals.com and Scout.com."
      ],
      "name" : "Datone Jones"
    },
    {
      "bio" : "As one of the biggest running backs on the team, Jones will see big minutes this year in the red zone. The junior stands at six feet, 220 pounds, making him a load to take on out of the backfield. Jones entered UCLA as one of the most hyped prospects in the history of the program as he was named the Gatorade National High School Player of the Year.",
      "bullets" : [
        "As a freshman, Jones had 311 total yards and a touchdown.",
        "Last season, he was named to the first team Pac-12 All-Academic team.",
        "Jones was rated as the No. 17 overall player in the 2010 recruiting class by Scout.com."
      ],
      "name" : "Malcolm Jones"
    },
    {
      "bio" : "Coming out of Oaks Christian High School, Adams performed well at UCLA’s preseason camp in San Bernardino, demonstrating he could make an impact as a true freshman in a position where the Bruins lack depth, where he saw a lot of reps as the first team nickelback.",
      "bullets" : [
        "Adams was one of the highest rated cornerback prospects in the nation, considered in the top 10 at the position by Scout.com, Rivals.com and ESPN.",
        "He was also selected to compete in the U.S. Army All-American Bowl, where he made an interception in the fourth quarter, which he returned for 27 yards."
      ],
      "name" : "Ishmael Adams"
    },
    {
      "bio" : "After first attending Tulane University out of high school in 2008, Allen transferred to UCLA after making one appearance in a game for the Green Wave. Upon transferring, Allen was required to sit out for a season but made an impact on special teams in 2010 and 2011, appearing in 12 games with two tackles and 11 games with five tackles, respectively. After his redshirt junior season, Allen transitioned from linebacker to fullback in the spring, which he had experience as in high school. Offensive coordinator Noel Mazzone has used all-purpose fullbacks in the past, with the ability to catch the ball out of the backfield as well as carry the ball and block.",
      "name" : "David Allen"
    },
    {
      "bio" : "A Loyola High School alum, Barocio initially redshirted his first season as a Bruin. After playing on the scout team for a year, Barocio saw action on the field as a member of the special teams unit during his redshirt freshman year. After the 2011 season, Barocio tore his anterior cruciate ligament during spring practices. However, refusing to let the injury hinder his progress, Barocio was seen doing pushups on the sidelines and working out however he could, citing his ambition to become the player to come back from such an injury quicker than anyone else.",
      "name" : "Librado Barocio"
    },
    {
      "bio" : "Barrett began his career at UNLV after graduating from Notre Dame High School and playing as a linebacker there. Barrett climbed up the depth chart as an H-back and tight end in the UNLV offensive system, impacting Rebels immediately. Barrett transferred to UCLA and is now entering his redshirt junior season, where he will be a Y-receiver for the Bruins.",
      "name" : "Jordan Barrett"
    },
    {
      "bio" : "McReynolds traveled across the country, from Washington, D.C., to play for the Bruins after four years at St. John’s College High School. In his first season as a Bruin, McReynolds did not see game action, but received the Charles Pike Memorial team award for Outstanding Defensive Scout Team Player. With a deep front line – considered the strength of the team – McReynolds will be fighting for playing time this season at nose tackle.",
      "bullets" : [
        "During high school, McReynolds was chosen to play in the Under Armour All-American Game."
      ],
      "name" : "Kevin McReynolds"
    },
    {
      "bio" : "Coming out of high school, Olaniyan was a highly sought after prospect from Woodberry Forest High School in Virginia. During his first year as a Bruin, Olaniyan was redshirted and was named the special teams winner of UCLA’s Charles Pike Memorial Award for Outstanding Scout Team Player. The next season, Olaniyan appeared in 13 games off the bench, seeing time at defensive end, linebacker as well as on special teams. His most notable play was his first tackle as a Bruin – a tackle for loss against California, which cemented a win for UCLA.",
      "bullets" : [
        "Olaniyan received first-team All-State honors three times during his high school career and received four-star ratings from ESPN, Scout.com and Rivals.com."
      ],
      "name" : "Aramide Olaniyan"
    },
    {
      "bio" : "Oliver is a huge prospect from Heritage High School in Brentwood, listed at 6-foot-7 and 290 pounds. He spent his first year at UCLA redshirting while trying to develop his technique as well as put on weight. Throughout spring practice and preseason camp, Oliver has been vying for the tackle position when healthy on the shallow offensive line, depleted by injuries.",
      "bullets" : [
        "Oliver has a listed wingspan of 84 inches."
      ],
      "name" : "Will Oliver"
    },
    {
      "bio" : "Orjioke is one of two players on the Bruins’ roster from the state of Georgia, where he had a productive career as a safety and linebacker. Orjioke grew up in Irvine and his desire to return to the Southern California region played a role in his decision to become a Bruin. At UCLA, he initially began preseason camp with the safeties but was moved over to work with the linebackers after gaining considerable strength in the offseason.",
      "bullets" : [
        "In his senior year, Orjioke amassed 74 tackles, seven interceptions, 25 pass breakups and a blocked punt."
      ],
      "name" : "Kenny Orjioke"
    },
    {
      "bio" : "Padovese was a two sport athlete from Marin Catholic High School, excelling in both basketball and football. On the hardwood, he was a team captain as well as team MVP his junior year while being named to the ESPN Rise Cal Hi Sports Top 50 Grid-Hoop Athletes and an Athlete of Distinction as a junior and senior. Padovese redshirted his first year at UCLA and looks to bolster an injury-depleted offensive line as a tackle.",
      "name" : "Michael Padovese"
    },
    {
      "bio" : "Pasquale is a freshman wide receiver from San Clemente High School.",
      "name" : "Nick Pasquale"
    },
    {
      "bio" : "Hailing from high school football powerhouse Mater Dei, Abbott enters his redshirt senior season at UCLA as one of the anchors of the defense. Due to depth issues at safety, Abbott has moved over from the cornerback position to safety throughout spring and preseason camp. He has also been used as a punt returner among other duties on special teams.",
      "bullets" : [
        "Last season, Abbott saw action in 13 games, starting seven.",
        "He tallied four interceptions, good for fourth most in the Pac-12. "
      ],
      "name" : "Andrew Abbott"
    },
    {
      "bio" : "While at Mission Viejo High School, Baca attended a UCLA football camp. On the day of camp he received his scholarship offer, he accepted the opportunity to attend the school of his childhood dreams. Baca had an immediate impact on the program, playing in nine games and starting in eight his freshman year at left tackle. Baca became a mainstay in 2009 as he played and started every game at left guard. However, in 2010 he was unable to see a snap on the field due to academic eligibility issues. After returning from a broken ankle in 2011, Baca started at both tackle and guard. Baca will be a focal point of the young offensive line and has established himself as a leader of the unit.",
      "name" : "Jeff Baca"
    },
    {
      "bio" : "Anthony Barr was one of the highest rated recruits in the nation from Los Angeles Loyola High School but had difficulty finding footing under coach Rick Neuheisel’s tenure. He began his first two years at UCLA as an F-back and was used sparingly. However, with the arrival of coach Jim Mora and the new coaching staff, Barr moved from the offensive side of the ball to the defensive as an outside linebacker during spring practice. Although injured and still gaining familiarity with the position throughout the spring, Barr has emerged in preseason camp as a linebacking stalwart capable of making game-changing plays.",
      "name" : "Anthony Barr"
    },
    {
      "bio" : "After losing the quarterback competition to redshirt senior Kevin Prince for the past three seasons, Brehaut is vying to take snaps in the team’s new spread offense as the backup again this year. Last season, he appeared in seven games with four starts. After Prince went down with an injury, Brehaut became the starter before suffering his own injury in the form of a fractured lower left leg.",
      "bullets" : [
        "Last season, Brehaut threw six touchdowns and only one interception.",
        "Brehaut recently quit the UCLA baseball team to focus on football."
      ],
      "name" : "Richard Brehaut"
    },
    {
      "bio" : "Brendel attended East Senior High School in Plano, Texas, gaining experience on both sides of the ball. After redshirting his first season at UCLA, Brendel has now solidified himself throughout the starting unit in spring practice and preseason camp. Brendel stepped in at the center spot on the offensive line as Greg Capella nursed an injury during spring practice. When Capella returned, he and Brendel competed for the center spot but Capella has since been moved to guard.",
      "bullets" : [
        "During his redshirt year, Brendel received the Coach Ed Kezirian “Coach K” Award for Academic and Athletic Balance.",
        "Brendel is a mathematics/applied science student. Brendel will major in mathematics/applied science. "
      ],
      "name" : "Jake Brendel"
    },
    {
      "bio" : "After playing at Visalia El Diamante High School, Capella redshirted his first year at UCLA and made only one appearance in 2010 after starting center Ryan Taylor had to leave due to dehydration against Texas. However, in his redshirt sophomore year, Capella established himself as a mainstay in the starting unit, starting all 14 games – 13 at guard and one at center. After competing throughout spring practices for the center spot with Jake Brendel, Capella has found time with the first unit as a guard throughout preseason camp. He has the versatility to start at both center and guard.",
      "name" : "Greg Capella"
    },
    {
      "bio" : "When recruiting Harris to come to UCLA, Jim Mora didn't stray far from a place he used to call home: Atlanta. Harris, a second-team all-state wide receiver from nearby Suwanee, Ga., is one of two recruits Mora plucked from the Peach State, along with Kenny Orjioke.",
      "name" : "Ahmaad Harris"
    },
    {
      "bio" : "True freshman receiver from Oaks Christian High School.",
      "name" : "Zach Hernandez"
    },
    {
      "bio" : "One of 10 players remaining from Rick Neuheisel's first UCLA recruiting class, Hester enters his fourth straight year penciled in as a starter at the cornerback position. He's been a steady leader of the secondary. But Hester has been prone to picking up costly penalties. In last season's win over Arizona State, one penalty call in particular sent Hester into a postgame tirade, leading to a reprimand from the conference and a brief suspension. That notwithstanding, Hester, with 23 starts in the last two seasons, is one of the most experienced defensive players on the roster and will be leaned on accordingly.",
      "bullets" : [
        "Four career interceptions",
        "Fourth-leading tackler (57 total) on team in 2011"
      ],
      "name" : "Aaron Hester"
    },
    {
      "bio" : "After a brief flirtation with playing running back – the position he played in high school – during spring ball, Hilliard is back on the defensive side of the ball at safety. Hilliard's athleticism has made him a reliable special teams and defensive performer since his true freshman year. While he hasn't been used as a starter in the past – a shoulder injury during the 2011 season and a concussion in 2010 possibly to blame – Hilliard will have a greater role on defense in his senior year. With Dietrich Riley and Alex Mascarenas both gone due to injury, Hilliard and Tevin McDonald are the only two players on the roster that have game experience at safety.",
      "bullets" : [
        "Started five games, all in 2011",
        "Blocked a punt in 2009 against Arizona State"
      ],
      "name" : "Dalton Hilliard"
    },
    {
      "bio" : "Hofmeister came to UCLA in the spring of 2011 as a junior college transfer from Riverside City College. Despite his early enrollment, Hofmeister never saw the field in 2011. He was buried on the depth chart this season as well until the medical retirement of fellow linebacker Patrick Larimore. In the shuffle of trying to replace Larimore, there could be an opening for Hofmeister to see the field this season.",
      "name" : "Ryan Hofmeister"
    },
    {
      "bio" : "Holmes was one of many Bruins to take on a new position under their new coach. For Holmes, the move from lineman to linebacker might pay dividends for the team, especially after the medical retirement of Patrick Larimore. Holmes has played in every game for the past three years on the defensive line and will take that experience to his new role.",
      "bullets" : [
        "Started 20 games from 2010 to 2011, all on defensive line",
        "Four career sacks"
      ],
      "name" : "Damien Holmes"
    },
    {
      "bio" : "Hulick, listed at 6-foot-2 and tipping the scales at 300 pounds, adds some size to an already stout offensive line. The true freshman played center for Esperanza High (Anaheim) while also wrestling for four years, twice reaching the state meet.",
      "name" : "Carl Hulick"
    },
    {
      "bio" : "Hundley arrived in Westwood with much fanfare in the spring of 2011. Preordained as the Bruins' quarterback of the future, the question of when exactly Hundley's future would become the Bruins' present was not answered until Aug. 10, when coach Jim Mora named him the opening day starter for the 2012 season. He was expected to compete for the starting position as a true freshman before an injury playing pickup basketball derailed his chances of winning the job. Former coach Rick Neuheisel hinted at using Hundley's dual passing and running abilities in a small package of plays throughout the season, but that plan never came to fruition and in the end, 2011 was a redshirt year for Hundley. He's still a freshman, albeit of the redshirt variety, but possesses a year's worth of sideline study and a vote of confidence from the coaching staff.",
      "name" : "Brett Hundley"
    },
    {
      "bio" : "When he signed with the Bruins in February, Nate Iese committed to join his cousin, offensive lineman Seali'i Epenesa. Unlike Epenesa, Iese is a defensive specialist who played on the defensive line in high school and is expected to play at linebacker.",
      "name" : "Nate Iese"
    },
    {
      "bio" : "Kody Innes, now a redshirt sophomore, hasn't seen game action for the Bruins. He remains a backup option at center.",
      "name" : "Kody Innes"
    },
    {
      "bio" : "A junior college transfer from Reedley College, Justin Moreno joined the Bruins as a walk-on to provide depth behind true freshman Ka'imi Fairbairn, the only scholarship kicker on the roster.",
      "name" : "Justin Moreno"
    },
    {
      "bio" : "Ian Taubler joins a stable of big tight ends, who will all be used as \"Y\" receivers in offensive coordinator Noel Mazzone's gameplan. Taubler is a true freshman who was an All-Fresno Bee selection in 2011 at Bullard High School.",
      "name" : "Ian Taubler"
    },
    {
      "bio" : "Iuta Tepa played 13 games last season as a backup defensive lineman, his first extensive action in a Bruin uniform. Still, the redshirt junior remains buried on the depth chart with plenty of players his year or younger around him.",
      "bullets" : [
        "One sack in 2011 (at Utah)",
        "Tore pectoral muscle midway through 2010 season and redshirted the year"
      ],
      "name" : "Iuta Tepa"
    },
    {
      "bio" : "For Thigpen, staying healthy has been an issue throughout his UCLA career. He had an impressive season as a true freshman in 2009, with big plays running and catching the ball as well as solid special teams play. Since then, a shoulder injury cut his 2010 season short and a nagging groin injury kept him from seeing the field in 2011, leading to a redshirt year. After a year away from the field, Thigpen is back and could be used as a dual-threat receiver as well as a return specialist.",
      "bullets" : [
        "In 2009: Rushed 26 times for 62 yards, caught seven passes for 41 yards",
        "Credited with 16 special teams tackles between the 2009 and 2010 seasons"
      ],
      "name" : "Damien Thigpen"
    },
    {
      "bio" : "True freshman from Manhasset, NY.",
      "name" : "Alessandro Troia"
    },
    {
      "bio" : "The redshirt freshman spent his first season as a Bruin on the sidelines. He will compete for playing time at the especially crowded nose tackle position in the new 3-4 defense.",
      "name" : "Brandon Tuliaupupu"
    },
    {
      "bio" : "Since transferring to UCLA in 2010, Bell has not seen much action in the blue and gold. This season, he will transfer from quarterback to the wide receiver spot.\nThe only action Bell came into was in the third quarter of a game against Washington following an injury to Richard Brehaut.\nBell had an extremely successful high school campaign at Archbishop Riordan in San Francisco. He led his team to a Central Coast Section title in 2007, the same year that he was named Quarterback of the Year in his league.\nAfter high school, Bell proceeded across the street to City College of San Francisco, where he led the team to a 9-1 record in 2009. Now, he will try to compete for time as a backup at the Y receiver behind starter Joseph Fauria.",
      "bullets" : [
        "Transferred in 2010 to UCLA from CCSF",
        "Hasn’t seen game action since his first season as a Bruin"
      ],
      "name" : "Darius Bell"
    },
    {
      "bio" : "Bono took a redshirt year in 2011, and starts his four years of eligibility this season. At Palo Alto High, he led the team to a 2010 CIF title.  He received a fair share of accolades in his senior year, including first-team all-state and San Jose Mercury News Player of the Year. He doesn’t limit himself to the football field – in 2012, Bono joined the UCLA baseball program as an outfielder. He played summer league baseball last summer with the Fontanetti A’s of the Far West League. Football runs in the Bono family blood – his father, Steve Bono, played at UCLA for four years and then fifteen in the NFL.",
      "bullets" : [
        "Heavily involved with the UCLA baseball program as an outfielder",
        "Transitioned from high school quarterback to college wide receiver"
      ],
      "name" : "Christoph Bono"
    },
    {
      "bio" : "Going into the season, it seemed as though Bowens would be an impact player for the Bruins. However, it seems as though the only aspect of his game that will have an impact is his absence, as he sits out the season with an injury. Bowens had a good amount of playing time in the last two seasons, with most of his experience coming from special teams. He had a career high in tackles against Arizona last season, with three.",
      "bullets" : [
        "Sitting out the 2012 season with a knee injury"
      ],
      "name" : "Isaiah Bowens"
    },
    {
      "bio" : "Carter has become a ready player for the Bruins on the defensive front. While he started his career as a linebacker, he moved into the tackle position and has seen great success there.  He came into all 14 games last season, even though he only started one, and he had a career-high in tackles with 6 against Washington State. His high school squad won city titles in back-to-back years, championships he was very much a part of. Both years, the team named him their defensive player of the year.",
      "bullets" : [
        "Played in every game in 2011 for UCLA",
        "Transitioned from linebacker to tackle last season"
      ],
      "name" : "Donovan Carter"
    },
    {
      "bio" : "Castro plays for the blue and gold, but that wasn’t always a done deal. He committed to Washington, and then Oregon before finally choosing UCLA after Jim Mora was hired as the Bruin coach. Castro played high school ball at Vista Murrieta, where he garnered much acclaim.",
      "bullets" : [
        "In high school, he was awarded the All-Inland Division Defensive Player of the Year, and became an All-Riverside County selection.",
        "Picked UCLA suddenly, although he had previously committed to Oregon and Washington",
        "Scout.com ranked him No. 21 among the nation’s outside linebacker recruits."
      ],
      "name" : "Jeremy Castro"
    },
    {
      "bio" : "Ceachir comes into UCLA as a sophomore, having played a year at Santa Monica City College. He started every single game at SMCC – his first experience with the game. In Ceachir’s native Moldova, he played a few club games, but never anything close to competitive high school football. He moved to Santa Monica in 2010, first playing on the team in 2011. At SMCC, he was named first-team all-conference. While he was a coveted recruit by many programs, Ceachir decided not to venture too far, leaving Santa Monica for Westwood.",
      "bullets" : [
        "Never played football before he began at SMCC in 2011",
        "Sophomore junior college transfer"
      ],
      "name" : "Alexandru Ceachir"
    },
    {
      "bio" : "Cid transferred to UCLA last summer from Citrus College. He started six games for the Bruins last year as an offensive guard, and went into spring practice this year with hopes of earning a starting spot. The path for Cid has zig-zagged, from West Covina High, to Mt. San Antonio Junior College, where he didn’t play football, to Citrus, to UCLA. In high school, Cid played three varsity seasons, garnering many honors and accolades, including All-CIF and All-San Gabriel Valley.",
      "bullets" : [
        "Transferred from Citrus College in Glendora",
        "Took a break from football for a year after high school"
      ],
      "name" : "Albert Cid"
    },
    {
      "bio" : "Combs was a highly ranked prospect within the state of New York, and chose to come all the way across the country to UCLA. He has been designated as a cornerback for college play, although he spent most of high school at quarterback. He garnered many accolades at Iona Prep, with all-league and All-America designations. His recruitment and scholarship sparked a major debate, in that his father is hip-hop mogul Sean Combs.",
      "bullets" : [
        "Switching from quarterback to cornerback",
        "All-American in high school"
      ],
      "name" : "Justin Combs"
    },
    {
      "bio" : "Cusik is a redshirt junior fullback from Orem, Utah.",
      "name" : "Alek Cusik"
    },
    {
      "bio" : "Cyburt enters his freshman year at UCLA as one of the top 50 offensive tackles in his recruiting class. He played high school ball at Mission Viejo, and garnered accolades such as Division I All-State and an ESPN All-Western United Stated first teamer.  He played in the CIF title game as a junior in high school.",
      "name" : "Colby Cyburt"
    },
    {
      "bio" : "Medina is a redshirt senior inside linebacker who played at St. Bonaventure High School.",
      "name" : "Ryan Medina"
    },
    {
      "bio" : "Payton was one of the most highly prized recruits of Jim Mora’s first recruiting class. The wide receiver out of Oaks Christian was designated a four-star recruit and, overall, the nation’s No. 15 wide reciever by both scout.com and Rivals. In high school, his abilities were often recognized, with All-CIF and All-Tri-Valley League selections, as well as a spot in the 2012 U.S. Army All-American Bowl game.",
      "bullets" : [
        "In his senior year, Payton had 18 touchdowns and 1088 yards receiving.",
        "Three-time Oaks Christian Offensive Player of the Year",
        "Played in 2012 U.S. Army All-American Bowl Game"
      ],
      "name" : "Jordan Payton"
    },
    {
      "bio" : "By ending up at UCLA, Perkins once again ends up at the same school as a former classmate, highly touted quarterback Brett Hundley. Perkins was a three star recruit (Rivals/Scout.com), who gained first-team All-State recognition at home in Arizona in his senior year.",
      "bullet" : [
        "Attended same high school as Brett Hundley",
        "First-team All-State in high school"
      ],
      "name" : "Paul Perkins"
    },
    {
      "bio" : "Porter, a linebacker, enters his freshman year coming out of a stellar high school career. In addition to great football talent, Porter had great promise as a baseball player, and was named the league MVP in his senior year. Eric Sondheimer of the LA Times reported in early June that Bruin baseball coach John Savage would welcome Porter onto the baseball squad in addition to football.",
      "bullets" : [
        "Excels in baseball as well as football",
        "No. 34 recruit in California, according to Rivals.com",
        "He totaled 172 tackles in his senior year, and was honored as the Freeway League Athlete of the Year and a Tom Lemming All-American."
      ],
      "name" : "Aaron Porter"
    },
    {
      "bio" : "Price is a redshirt sophomore defensive back from Mater Dei High School.",
      "name" : "Dylan Price"
    },
    {
      "bio" : "Price is one of the only two returners at cornerback, and has plenty of Bruin playing experience to back him up. He started 12 games in 2011, ranking in the top 20 in the Pac-12 for passes defensed. He has made his presence known for several years, having started 11 of 13 games of his freshman year, in 2009. He had four stops in the Bruins’ bowl win over Temple. With 32 career starts under his belt, Price looks like a veteran for the Bruins to rely on in a year that brings much change with it.",
      "bullets" : [
        "Also competed in his freshman year for the UCLA track team",
        "32 career starts"
      ],
      "name" : "Sheldon Price"
    },
    {
      "bio" : "With the medical retirement of Patrick Larimore, Kendricks enters the 2012 season as the Bruins’ leader in tackles. Kendricks opens the season as the starting inside linebacker next to redshirt senior Damien Holmes and looks to be a key cog in UCLA’s defense. He was one of the better form tacklers on a team that lacked them last year.",
      "bullets" : [
        "As a senior at Herbert Hoover High School in Fresno, Kendricks had 117 tackles and two interceptions.",
        "Had 77 tackles for UCLA last season",
        "Registered a career-high 10 tackles in the bowl game against Illinois"
      ],
      "name" : "Eric Kendricks"
    },
    {
      "bio" : "Lagace is a true freshman defensive back who doesn’t figure to make much of an impact this season.",
      "bullets" : [
        "In his senior season at Arcadia High School, Lagace had 45 tackles, one interception and a forced fumble."
      ],
      "name" : "Taylor Lagace"
    },
    {
      "bio" : "Locke is widely considered one of the best punters in the country, as indicated by his recent appearance on the Ray Guy Award watch list. Locke has good reason to be on the list as he has much in common with its namesake.\nLike Guy, Locke routinely produces booming punts that are also accurate, putting opposing teams in bad spots. Even though Locke plays an often overlooked position, his play shouldn’t be. His deep, accurate kicks give the UCLA defense a lot of room to work with, making its job much easier.",
      "bullets" : [
        "Had a season-long 70-yard punt last year against Texas",
        "Had 21 touchbacks off of kickoffs last season"
      ],
      "name" : "Jeff Locke"
    },
    {
      "bio" : "Jake Seydel is a sophomore guard and recently transferred from Riverside college.",
      "name" : "Jake Seydel"
    }
  ]
}